Revit 2027 API
ElementIdSetFilter.GetIdsToInclude Method
 Returns the ids of this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetIdsToInclude()
Public Function GetIdsToInclude As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetIdsToInclude()
member GetIdsToInclude : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The collection of ids.
See Also
Reference
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace